<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"azurerm","backend":"e8b1feaa6967aa42376af9fa25c600db2e7f59a5dfe014eb9bd9ee71d9f859c1","plan_job_ref":"Job Create Terraform plan (DEV) #76 at https://github.com/AudioProthese/openmrs-core-infrastructure/actions/runs/14996531883","plan_out_hash":"99f704c6141e5246c168be6638651c08cadeae9ca94184ba579c2074cd2a6265","plan_hash":"481c197437f1e7db03ee16f3a6fc97b85700ed83ed0fe213f534641b2b216d0d","plan_text_format":"diff","version":"1.48.0"} -->
Terraform plan in __terraform/dev/__
<details>
<summary>Plan: 4 to add, 1 to change, 2 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
!~  update in-place
-   destroy

Terraform will perform the following actions:

  # azurerm_kubernetes_cluster.aks will be updated in-place
!~  resource "azurerm_kubernetes_cluster" "aks" {
        id                                  = "/subscriptions/b33703ee-cc2d-4e8b-bd23-c259839be42e/resourceGroups/rg-openmrscore-dev/providers/Microsoft.ContainerService/managedClusters/openmrs-dev-audioprothese-aks"
        name                                = "openmrs-dev-audioprothese-aks"
        tags                                = {
            "Environment"  = "dev"
            "organization" = "audioprothese"
            "project"      = "openmrs"
        }
#        (31 unchanged attributes hidden)

!~      default_node_pool {
            name                          = "default"
            tags                          = {}
#            (30 unchanged attributes hidden)

-           upgrade_settings {
-               drain_timeout_in_minutes      = 0 -> null
-               max_surge                     = "10%" -> null
-               node_soak_duration_in_minutes = 0 -> null
            }
        }

#        (4 unchanged blocks hidden)
    }

  # azurerm_storage_container.chunks will be destroyed
  # (because azurerm_storage_container.chunks is not in configuration)
-   resource "azurerm_storage_container" "chunks" {
-       container_access_type             = "private" -> null
-       default_encryption_scope          = "$account-encryption-key" -> null
-       encryption_scope_override_enabled = true -> null
-       has_immutability_policy           = false -> null
-       has_legal_hold                    = false -> null
-       id                                = "/subscriptions/b33703ee-cc2d-4e8b-bd23-c259839be42e/resourceGroups/rg-openmrscore-dev/providers/Microsoft.Storage/storageAccounts/openmrscoredevsa02/blobServices/default/containers/chunks" -> null
-       metadata                          = {} -> null
-       name                              = "chunks" -> null
-       resource_manager_id               = "/subscriptions/b33703ee-cc2d-4e8b-bd23-c259839be42e/resourceGroups/rg-openmrscore-dev/providers/Microsoft.Storage/storageAccounts/openmrscoredevsa02/blobServices/default/containers/chunks" -> null
-       storage_account_id                = "/subscriptions/b33703ee-cc2d-4e8b-bd23-c259839be42e/resourceGroups/rg-openmrscore-dev/providers/Microsoft.Storage/storageAccounts/openmrscoredevsa02" -> null
#        (1 unchanged attribute hidden)
    }

  # azurerm_storage_container.loki-admin will be created
+   resource "azurerm_storage_container" "loki-admin" {
+       container_access_type             = "private"
+       default_encryption_scope          = (known after apply)
+       encryption_scope_override_enabled = true
+       has_immutability_policy           = (known after apply)
+       has_legal_hold                    = (known after apply)
+       id                                = (known after apply)
+       metadata                          = (known after apply)
+       name                              = "loki-admin"
+       resource_manager_id               = (known after apply)
+       storage_account_id                = "****************************************************************************************************************************************************"
    }

  # azurerm_storage_container.loki-chunks will be created
+   resource "azurerm_storage_container" "loki-chunks" {
+       container_access_type             = "private"
+       default_encryption_scope          = (known after apply)
+       encryption_scope_override_enabled = true
+       has_immutability_policy           = (known after apply)
+       has_legal_hold                    = (known after apply)
+       id                                = (known after apply)
+       metadata                          = (known after apply)
+       name                              = "loki-chunks"
+       resource_manager_id               = (known after apply)
+       storage_account_id                = "****************************************************************************************************************************************************"
    }

  # azurerm_storage_container.loki-ruler will be created
+   resource "azurerm_storage_container" "loki-ruler" {
+       container_access_type             = "private"
+       default_encryption_scope          = (known after apply)
+       encryption_scope_override_enabled = true
+       has_immutability_policy           = (known after apply)
+       has_legal_hold                    = (known after apply)
+       id                                = (known after apply)
+       metadata                          = (known after apply)
+       name                              = "loki-ruler"
+       resource_manager_id               = (known after apply)
+       storage_account_id                = "****************************************************************************************************************************************************"
    }

  # azurerm_storage_container.ruler will be destroyed
  # (because azurerm_storage_container.ruler is not in configuration)
-   resource "azurerm_storage_container" "ruler" {
-       container_access_type             = "private" -> null
-       default_encryption_scope          = "$account-encryption-key" -> null
-       encryption_scope_override_enabled = true -> null
-       has_immutability_policy           = false -> null
-       has_legal_hold                    = false -> null
-       id                                = "/subscriptions/b33703ee-cc2d-4e8b-bd23-c259839be42e/resourceGroups/rg-openmrscore-dev/providers/Microsoft.Storage/storageAccounts/openmrscoredevsa02/blobServices/default/containers/ruler" -> null
-       metadata                          = {} -> null
-       name                              = "ruler" -> null
-       resource_manager_id               = "/subscriptions/b33703ee-cc2d-4e8b-bd23-c259839be42e/resourceGroups/rg-openmrscore-dev/providers/Microsoft.Storage/storageAccounts/openmrscoredevsa02/blobServices/default/containers/ruler" -> null
-       storage_account_id                = "/subscriptions/b33703ee-cc2d-4e8b-bd23-c259839be42e/resourceGroups/rg-openmrscore-dev/providers/Microsoft.Storage/storageAccounts/openmrscoredevsa02" -> null
#        (1 unchanged attribute hidden)
    }

  # helm_release.loki will be created
+   resource "helm_release" "loki" {
+       atomic                     = false
+       chart                      = "loki"
+       cleanup_on_fail            = false
+       create_namespace           = true
+       dependency_update          = false
+       disable_crd_hooks          = false
+       disable_openapi_validation = false
+       disable_webhooks           = false
+       force_update               = false
+       id                         = (known after apply)
+       lint                       = false
+       manifest                   = (known after apply)
+       max_history                = 0
+       metadata                   = (known after apply)
+       name                       = "loki"
+       namespace                  = "loki"
+       pass_credentials           = false
+       recreate_pods              = false
+       render_subchart_notes      = true
+       replace                    = false
+       repository                 = "https://grafana.github.io/helm-charts"
+       reset_values               = false
+       reuse_values               = false
+       skip_crds                  = false
+       status                     = "deployed"
+       timeout                    = 300
+       values                     = [
+           <<-EOT
                loki:
                  podLabels:
                    "azure.workload.identity/use": "true"
                  schemaConfig:
                    configs:
                      - from: "2024-04-01"
                        store: tsdb
                        object_store: azure
                        schema: v13
                        index:
                          prefix: loki_index_
                          period: 24h
                  ingester:
                    chunk_encoding: snappy
                
                  storage:
                    type: azure
                    azure:
                      accountName: "openmrscoredevsa02"
                      accountKey:
                      useManagedIdentity: true
                      useFederatedToken: true
                      userAssignedId: "d6de217f-32de-4118-b479-9c958a3e40c4"
                    bucketNames:
                      chunks: "loki-chunks"
                      ruler: "loki-ruler"
                      admin: "loki-admin"
                
                minio:
                  enabled: false
                
                deploymentMode: SingleBinary
                
                singleBinary:
                  replicas: 3
                  persistence:
                    storageClass: gp2
                    accessModes:
                      - ReadWriteOnce
                    size: 30Gi
                
                backend:
                  replicas: 0
                read:
                  replicas: 0
                write:
                  replicas: 0
                
                ingester:
                  replicas: 0
                querier:
                  replicas: 0
                queryFrontend:
                  replicas: 0
                queryScheduler:
                  replicas: 0
                distributor:
                  replicas: 0
                compactor:
                  replicas: 0
                indexGateway:
                  replicas: 0
                bloomCompactor:
                  replicas: 0
                bloomGateway:
                  replicas: 0
            EOT,
        ]
+       verify                     = false
+       version                    = "6.29.0"
+       wait                       = true
+       wait_for_jobs              = false
    }

Plan: 4 to add, 1 to change, 2 to destroy.
```
</details>

:memo: Plan generated in [Create Terraform plan (DEV) #76](https://github.com/AudioProthese/openmrs-core-infrastructure/actions/runs/14996531883)